/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cveeta <cveeta@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/19 18:59:51 by cveeta            #+#    #+#             */
/*   Updated: 2020/11/27 19:48:30 by cveeta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

int main()
{
	char qwe = 0b1111111;
	size_t chisl0  = 1;
	//printf("%#d ", 10000000);
	//ft_printf("🤡 - а это миша но уже чемез мой принт");
	char c = 255;
	printf("|миша пидор на %-10% 100|\n");
	ft_printf("|миша пидор на %-10% 100|");

	//ft_printf("%-5%");


}